// 4 Задача

// В программе объявлены три переменные a, b и c, в которые записаны числовые значения. 
// Определите максимальное значение и выведите его в консоль.
// Методом max пользоваться нельзя.

// Пример значений переменных:
// let a = 32
// let b = 50
// let c = 140

// -----------------
// if (a > b){
//     if(a > c){
//         console.log(a)
//     } else {
//         console.log(c)
//     }
// } else {
//     if (b > c){
//         console.log(b)
//     } else {
//         console.log(c)
//     }
// }

// -----------------
// console.log(Math.max(a,b,c))
 

//---------------------------
// 5
// В программе объявлены три переменные: a, b и sign. 
// Переменные a и b хранят численное значение. Переменная sign - строковое значение, 
// которое отражает математический знак, например: (+,-,/,*). Необходимо написать простой калькулятор, 
// который в зависимости от значения переменной sign будет совершать соответствующие математические 
// операции с переменными a и b. В случаи попытки поделить на 0 программа должна выводить в консоль 
// cообщение: “делить на 0 нельзя”. 

// Пример значений переменных: 
// let a = 25
// let b = 0
// let sign = '/'


// if (sign == '+'){
//     console.log(a + b)
// } else if (sign == '-'){
//     console.log(a - b)
// } else if (sign == '*'){
//     console.log(a * b)
// } else if (sign == '/'){
//     if (b == 0){
//         console.log('Делить на 0 нельзя')
//     } else {
//         console.log(a / b)
//     }
// }

// ------------------------------
// 6
// В программе объявлены две переменные — temp и weather. 
// Объявите переменную activity и присвойте ей значение по следующему правилу:
// если значение переменной temp больше либо равно 25, a переменная weather имеет значение "clear", 
// тогда значение переменной activity должно быть "golf";
// если значение переменной temp от 10 до 24, a переменная weather имеет значение "clear", 
// тогда значение переменной activity должно быть "bowling";
// в ином случае значение переменной activity должно быть "hiking"


// Пример значений переменных:
// let temp = 25
// let weather = "clear"

// let activity = ''

// if (temp >= 25 && weather == 'clear'){
//     activity = 'golf'
// } else if (temp >= 10 && temp <= 24 && weather == 'clear'){
//     activity = 'bowling'
// } else {
//     activity = 'hiking'
// }


// console.log(activity)