// 1 Задание
for (let i = 0; i <= 100; i++){
    if(i % 5 == 0){
        console.log(i);
    }
}



// 2 Задание
for (let i = 1900; i <= 2023; i++){
    if(i % 4 == 0){
        console.log(i);
    }
}



// 3 Задание
for (let a = 0; a <= 100; a++){
     // Цикл создаёт переменную а равную 0
    for (let b = 2; b <= a; b++){
         // Цикл переменной b создаёт переменную b равную 2, и на каждой итерации увеличивает на 1, пока b не станет равной a
        if (a % b == 0 && b < a) {
              // Если а делится на b без остатка и если b меньше а, то цикл b прерывается и программа переходит к следующей итерации цикла а
            break;

        } else if (b == a) {
             // Если b всё же равно а, то это значит что а не имеет делителей, кроме самого себя и 1, в результате мы получаем простое число
            console.log(a);
        }
    }
}



// 4 Задание
let word = "hello";


for (let i = word.length - 1; i >= 0; i--) { 
    // Переменная i равная word.length - 1 означает, что i начинает свой путь с последней буквы слова;
    // i >= 0 проверяет, больше ли или равно i нулю, если да, то цикл продолжает выполнятся;
    // i-- означает, что переменная i уменьшается на 1 и что на следующей итерации цикла будет обработана предыдущая буква слова
    console.log(word[i]); 
    // Квадратные скобки используются что бы обратится к в букве в слове по индексу i, который на каждой следующей итерации цикла выводит следующую букву
}



// 5 Задание
let w = "hello";

let invertedWord = "";
//Создаётся пустая переменная, которая будет использоваться для хранения перевёрнутой строки w


for (let i = w.length - 1; i >= 0; i--) { // (см. задание №4)
    invertedWord = invertedWord + w[i];
    // На каждой итерации цикла, буква, которая находится по индексу i, добавляется к переменной invertedWord
}
console.log(invertedWord);