// 2 Задача
// function checkSome(array,callback) {

//     let found = false; // Эта переменная будет показывать был ли найден хотя бы 1 элемент, подходящий под условие задачи
//     // (значение false используется как изначальное значение булевого типа);


//     for (let i = 0; i < array.length; i++) {

//       if (callback(array[i])) { // Оператор if проверяет каждый результат итерации на наличие элемента, который подходит под условие задачи и если находит,
//         found = true;
//         break; // то меняет значение found на true и выходит из  цикла с помощью оператора break;
//       }

//     }


//     if (found) { // После завершения цикла проверяем значение переменной found;
//       return "Минимум 1 элемент удовлетворяет указанному условию"; // если true;
//     } else {
//       return "Ни один элемент не удовлетворяет указанному условию"; // если false;
//     }
// }


// let array = [1,2,3,4,5];
// let result = checkSome(array, (elem) => elem === 4 );
// let result = checkSome(array, (elem) => elem === 6 );
// console.log(result);










// 1 Задача
function checkEven(array, callback) {
    for (let i = 0; i < array.length; i++) {
      if (!callback(array[i])) { // Если условие не выполнено для какого-то элемента массива,
        //(знак ! перед callback(array[i]) меняет логическое значение на противоположное)
        return "Не все элементы удовлетворяют указанному условию"; //  то возвращаем сообщение о том, что не все элементы удовлетворяют условию;
      }
    }
    return "Все элементы удовлетворяют указанному условию"; // Если все элементы массива удовлетворяют условию, то возвращаем сообщение об этом;
  }
  
  let array = [1,2,3,4,5];
  let result = checkEven(array, (elem) => elem > 0);
  console.log(result);
  
  array = [1,2,3,4,5];
  result = checkEven(array, (elem) => elem < 4);
  console.log(result);