//Сравнение строк
//Сравнение символов происходит исходя из их ASCII кода
//          65    97
console.log('A' > 'a'); //false
console.log('A' < 'a'); //true (41<61)

//Что бы узнать ASCII код символа используется метод .charCodeAt()
let a = 'ab'
console.log(string.charCodeAt(0)) //ASCII код b (отсчёт начинается с нуля (a=0,b=1))
//                            97

//-------------------------
//В процессе сравнение строк происходит парное сравнение ASCII кодом символов.
//В тот момент, когда определяются разные символы - сравнение выносит вердикт, сравнив их ASCII код
//      'Велосипед'
//       ====<
//      'Велотренажер'
console.log('Велосипед' > 'Велотренажер');
//         false
console.log('Велосипед' < 'Велотренажер');
//         true

//-------------------------
console.log('Вело' > 'Велос') //(false)

// 'Вело'
//  ==== < 
// 'Велос'

//Больше будет Велос, т.к. в приоритете строка с наибольшей длиной.

//-------------------------
// Сторогое/Не строгое сравнение

//Не строгое сравнение
//Позволяет сравнивать значение, игнорируя тип данных
console.log(10 == '10')
//            true

//Строгое сравнение
//Сравнивает как значение, так и тип данных
console.log(10 === '10')
//            false

//-------------------------
console.log(null == undefined);
//          true
console.log(null === undefined);
//          false