/*
    Условные операторы 
-----------------------------   

==, <, >, !=, <=, >=

Условие всегда будет возвращать булевый тип (false или true)

let a = 10 == 5     false
let a = 100 > 50    true
let a = 100 != 1    true

---------------------------------------

    Логические операторы
-----------------------------      

!  - НЕ
&& - И
|| - ИЛИ

Логический оператор И(&&) соединяет несколько условий и работает по следующему правилу:
Среди всех условных операторов он ищет в сравнениях ответ FALSE.
Если хотябы одно условие вернет тип FALSE - то итоговое выражение станет FALSE.
Если не будет найден FALSE, тогда итоговое выражение станет TRUE.

    TRUE    FALSE
let a = 100 > 90 && 10 != 10
false

    TRUE    FALSE
let a = 100 > 90 && 10 == 10
true

-------

Логический оператор ИЛИ(||) соединяет несколько условий и работает по следующему правилу:
Среди всех условных операторов он ищет в сравнениях ответ TRUE.
Если хотябы одно условие вернет тип TRUE - то итоговое выражение станет TRUE.
Если не будет найден TRUE, тогда итоговое выражение станет FALSE.

    TRUE    FALSE
let a = 10 == 10 || 100 < 50 
true

    TRUE    FALSE   FALSE
let a = 10 != 15 || 50 >= 61 || 90 < 80    
true

    TRUE    TRUE
let a = 99 >= 98 && 101 < 102
true

-------

!   - НЕ
Его задача - конвертировать булевый тип с true на false или с false на true
*/