//      *_While_*

//Задача: сделать 50 console.log от 0 до 49

// Циклом управляют 3 параметра
// 1) Переменная i
// 2) Условие
// 3) Шаг

let i = 0;

while(i < 10){
    console.log(i)
    i = i + 1 // i += 1 
}

//Напишите цикл, который вернёт диапазон от 20 до 30
let l = 20;
while(l <= 30){
    console.log(l)
    l += 1
}

//Напишите цикл, который вернёт диапазон от 10 до 0
let a = 10;
while(a >= 0){
    console.log(a)
    a -= 1
}

//Напишите цикл, который вернёт диапазон от 0 до 10 (но только чётные числа)
let b = 0;
while(b <= 10){
    console.log(b)
    b += 2
}

//Выведите диапазон чисел от 10 до -10 включительно
let x = 10;
while(x >= -10){
    console.log(x)
    x -= 1
}


//-----------------------------
//      *_Do...while_*

// Отличие заключается в том, что в do while сначала выполняется тело, а только потом проверяется условие
// Гарантирует выполнение хотя бы 1 итерации вне зависимости от указанного в while условия 

let y = 0;

do {
    console.log(y)
    y += 1
} while (y <= 10)

//Второй пример
let c = 10;

do {
    console.log(c)
    c += 1
} while (c == 100)

//-----------
// Пример на while

// let i = 10

// while(i == 100){
//     console.log(i)
//     i += 1
// }


//-----------------------------
//      *_For_*

// for(переменная i; условие; шаг){
//}    

for(let int = 0; int <= 10; int++){
    console.log(int)
}

//--------------------
// if внутри цикла for

// Вывести диапазон от 0 до 10 (только чётные числа)

// Решение 1
//for (let f = 0; f <= 10; f += 2){
//    console.log(f);
//}

// Решение 2
for (let f = 0; f <= 10; f++){
    if(f % 2 != 0){
        console.log(f);
    }
}

//Вывести набор чисел от 0 до 10, кроме 5 и 8
for (let f = 0; f <= 10; f++){
    if(f != 5 && f != 8){
        console.log(f);
    }
}

//Выведите числа от 0 до 100 (только те, у которых вычисляется квадратный корень)
for (let f = 0; f <= 100; f++){
    if(f % Math.sqrt(f) == 0){
        console.log(f);
    }
}    
// или
for (let f = 0; f <= 100; f++){
    if(Math.sqrt(f) % 1 == 0){
        console.log(f);
    }
}    

//--------------------

let string = 'world!'

for(let o = 0; o <= 5; o++){
    console.log(string[i]);
}